Repository: ateeqdev/google-login-only-wp
Catalog: languages/one-tap-login-*.po
Languages: hu_hu

source: One Tap Login
hu_hu: Egyérintéses bejelentkezés

source: Replaces standard WordPress password authentication with Social Sign-In (currently Google) and One Tap. Features beautiful UI, automatic user management, and enhanced security options. Born from necessity after a successful brute-force attack on hardtoskip, this plugin enforces Google-only authentication to keep your site secure.
hu_hu: A hagyományos WordPress jelszavas hitelesítést közösségi bejelentkezéssel (jelenleg Google) és One Tap funkcióval helyettesíti. Szép felhasználói felületet, automatikus felhasználókezelést és kibővített biztonsági beállításokat kínál. A hardtoskip elleni sikeres brute-force támadás után szükségből született: ez a bővítmény csak Google-alapú hitelesítést engedélyez, hogy megvédje az oldaladat.

source: Saving...
hu_hu: Mentés...

source: Settings Saved!
hu_hu: Beállítások elmentve!

source: An error occurred.
hu_hu: Hiba történt.

source: Testing...
hu_hu: Tesztelés...

source: Validation successful!
hu_hu: Érvényesítés sikeres!

source: Validation failed
hu_hu: Érvényesítés sikertelen

source: Are you sure you want to remove this user?
hu_hu: Biztosan eltávolítod ezt a felhasználót?

source: Please fill in both Client ID and Client Secret.
hu_hu: Kérjük, add meg a Client ID-t és a Client Secretet is.

source: Copied!
hu_hu: Másolva!

source: Failed to copy.
hu_hu: A másolás sikertelen.

source: One Tap Login Settings
hu_hu: Egyérintéses bejelentkezés beállításai

source: Social Login
hu_hu: Közösségi bejelentkezés

source: Secure Google Authentication for WordPress
hu_hu: Biztonságos Google-hitelesítés WordPresshez

source: Quick Status
hu_hu: Gyors állapot

source: Configuration:
hu_hu: Konfiguráció:

source: Complete
hu_hu: Befejezett

source: Pending
hu_hu: Függőben

source: Authorized Users:
hu_hu: Engedélyezett felhasználók:

source: Security Features:
hu_hu: Biztonsági funkciók:

source: Quick Links
hu_hu: Gyorshivatkozások

source: Test Login Page
hu_hu: Bejelentkezési oldal tesztelése

source: Google Cloud Console
hu_hu: Google Cloud konzol

source: Plugin Creator
hu_hu: Bővítmény készítője

source: Hire Developer
hu_hu: Fejlesztő felvétele

source: Welcome to One Tap Login
hu_hu: Üdvözlünk az Egyérintéses bejelentkezésben

source: Transform your WordPress authentication with secure Google Sign-In. This setup wizard will guide you through each step to ensure optimal security and user experience.
hu_hu: Alakítsd át WordPress hitelesítésedet biztonságos Google bejelentkezéssel. Ez a telepítő varázsló végigvezet minden lépésen, hogy biztosítsa az optimális biztonságot és felhasználói élményt.

source: Enhanced Security
hu_hu: Fokozott biztonság

source: Eliminate password-based vulnerabilities with Google's robust OAuth authentication system.
hu_hu: Számolj le a jelszóalapú sebezhetőségekkel a Google erős OAuth-hitelesítési rendszerével.

source: User Management
hu_hu: Felhasználókezelés

source: Control exactly who can access your site with email-based authorization and role assignment.
hu_hu: Pontosan szabályozd, ki férhet hozzá az oldaladhoz e-mail alapú engedélyezéssel és szerepkör-hozzárendeléssel.

source: Seamless Experience
hu_hu: Zökkenőmentes élmény

source: Google One Tap provides instant authentication for users already signed into Google.
hu_hu: A Google One Tap azonnali hitelesítést biztosít a Google-be már bejelentkezett felhasználóknak.

source: Your plugin is not yet configured. Users cannot log in until you complete the Google API setup.
hu_hu: A bővítmény még nincs beállítva. A felhasználók nem tudnak bejelentkezni, amíg nem fejezed be a Google API beállítását.

source: One Tap Login is configured and working. You can modify settings or enable additional features anytime.
hu_hu: Az Egyérintéses bejelentkezés be van állítva és működik. Bármikor módosíthatod a beállításokat vagy engedélyezhetsz további funkciókat.

source: Start Configuration
hu_hu: Beállítás megkezdése

source: Google API Configuration
hu_hu: Google API beállítása

source: Set up your Google OAuth credentials to enable secure authentication. This is the most important step.
hu_hu: Állítsd be a Google OAuth hitelesítő adataidat a biztonságos bejelentkezéshez. Ez a legfontosabb lépés.

source: Setup Instructions
hu_hu: Beállítási utasítások

source: Visit the %s
hu_hu: Látogass el a %s

source: Create a new project or select an existing one.
hu_hu: Hozz létre egy új projektet, vagy válassz egy meglévőt.

source: Navigate to \
hu_hu: Navigálj ide \

source: Click \
hu_hu: Kattints a \

source: Choose \
hu_hu: Válaszd a \

source: Add the redirect URIs and origins provided below.
hu_hu: Add hozzá az alább megadott átirányítási URI-kat és eredeteket.

source: Required URLs for Google Console
hu_hu: A Google Konzolhoz szükséges URL-ek

source: Authorized redirect URIs (add both)
hu_hu: Engedélyezett átirányítási URI-k (mindkettőt add hozzá)

source: Copy
hu_hu: Másolás

source: Authorized JavaScript origins
hu_hu: Engedélyezett JavaScript eredetek

source: Google OAuth Credentials
hu_hu: Google OAuth hitelesítő adatok

source: Google Client ID
hu_hu: Google kliensazonosító (Client ID)

source: e.g., 123456789.apps.googleusercontent.com
hu_hu: pl.: 123456789.apps.googleusercontent.com

source: Google Client Secret
hu_hu: Google kliens titok (Client Secret)

source: e.g., GOCSPX-xxxxxxxxxx
hu_hu: pl.: GOCSPX-xxxxxxxxxx

source: Back
hu_hu: Vissza

source: Test Connection
hu_hu: Kapcsolat tesztelése

source: Save & Continue
hu_hu: Mentés és tovább

source: Security Features
hu_hu: Biztonsági funkciók

source: Enable additional security measures to protect your site from common attack vectors.
hu_hu: Engedélyezd a további biztonsági intézkedéseket, hogy megvédd az oldaladat a gyakori támadási vektoroktól.

source: Important Note:
hu_hu: Fontos megjegyzés:

source: This plugin was developed in response to real brute-force attacks. These features help reduce common risks but should be part of a comprehensive security strategy.
hu_hu: Ezt a bővítményt valós brute-force támadások miatt fejlesztettük. Ezek a funkciók csökkentik az általános kockázatokat, de a teljes biztonsági stratégia részeként kell alkalmazni őket.

source: Disable XML-RPC
hu_hu: XML-RPC letiltása

source: Prevents brute-force attacks via XML-RPC. May affect mobile apps or Jetpack.
hu_hu: Megakadályozza az XML-RPC-n keresztüli brute-force támadásokat. Hatással lehet mobilalkalmazásokra vagy a Jetpackre.

source: Disable File Editing
hu_hu: Fájl szerkesztés letiltása

source: Prevents code injection via the admin dashboard if an account is compromised.
hu_hu: Megakadályozza a kód beszúrását az admin felületen, ha egy fiók kompromittálódik.

source: Hide WordPress Version
hu_hu: WordPress verzió elrejtése

source: Makes it harder for attackers to identify vulnerabilities for a specific WP version.
hu_hu: Megnehezíti a támadók számára, hogy egy adott WP-verzió sebezhetőségeit azonosítsák.

source: Restrict REST API
hu_hu: REST API korlátozása

source: Prevents unauthorized data access via REST API. May affect some plugins.
hu_hu: Megakadályozza a jogosulatlan adatlekérést a REST API-n keresztül. Hatással lehet egyes bővítményekre.

source: Block Sensitive Files
hu_hu: Érzékeny fájlok blokkolása

source: Attempts to block direct public access to wp-config.php and other sensitive files.
hu_hu: Megkísérli blokkolni a wp-config.php és más érzékeny fájlok közvetlen nyilvános elérését.

source: Control who can access your site. Add Google email addresses and assign roles for authorized users.
hu_hu: Szabályozd, ki férhet hozzá az oldaladhoz. Adj hozzá Google e-mail címeket és rendelj szerepeket az engedélyezett felhasználókhoz.

source: Authorized Users
hu_hu: Engedélyezett felhasználók

source: Add User
hu_hu: Felhasználó hozzáadása

source: Email Address
hu_hu: E-mail cím

source: Role
hu_hu: Szerepkör

source: New User Registration
hu_hu: Új felhasználó regisztráció

source: Allow New User Sign-Ups
hu_hu: Új felhasználók regisztrálásának engedélyezése

source: Allow any Google user to create an account. This bypasses the authorized user list above.
hu_hu: Engedélyezi, hogy bármely Google felhasználó fiókot hozzon létre. Ez megkerüli a fenti engedélyezett felhasználói listát.

source: Default Role for New Users
hu_hu: Alapértelmezett szerepkör az új felhasználóknak

source: Subscriber is the safest and recommended option for new public registrations.
hu_hu: 'Feliratkozó' a legbiztonságosabb és ajánlott opció nyilvános regisztrációkhoz.

source: Configure Google One Tap for a seamless, one-click user authentication experience.
hu_hu: Állítsd be a Google One Tapet a zökkenőmentes, egykattintásos hitelesítési élményért.

source: What is Google One Tap?
hu_hu: Mi az a Google One Tap?

source: One Tap displays a non-intrusive prompt that allows users already signed into Google to authenticate instantly. It is automatically enabled on the WordPress login page.
hu_hu: A One Tap egy nem tolakodó felugró ablakot jelenít meg, amely lehetővé teszi a Google-be már bejelentkezett felhasználók számára az azonnali hitelesítést. Automatikusan engedélyezett a WordPress bejelentkezési oldalon.

source: Enable One Tap on Homepage
hu_hu: One Tap engedélyezése a kezdőlapon

source: Show the One Tap prompt to logged-out visitors on your homepage and other public pages.
hu_hu: Mutasd a One Tap felugrót kijelentkezett látogatóknak a kezdőlapon és más nyilvános oldalakon.

source: Setup Complete!
hu_hu: Beállítás befejezve!

source: Congratulations! Your One Tap Login plugin is now configured and ready to secure your WordPress site.
hu_hu: Gratulálunk! Az Egyérintéses bejelentkezés bővítményed most be van állítva és készen áll WordPress oldalad védelmére.

source: Your Site is Now Secured
hu_hu: Az oldalad most már védett

source: Password-based authentication has been disabled. Users must now authenticate through Google, significantly reducing security risks.
hu_hu: A jelszóalapú hitelesítés le van tiltva. A felhasználóknak mostantól a Google-on keresztül kell hitelesíteniük, ami jelentősen csökkenti a biztonsági kockázatokat.

source: Test Login
hu_hu: Bejelentkezés tesztelése

source: Try the new login experience
hu_hu: Próbáld ki az új bejelentkezési élményt

source: Manage Users
hu_hu: Felhasználók kezelése

source: View your WordPress users
hu_hu: WordPress felhasználóid megtekintése

source: Return to Overview
hu_hu: Vissza az áttekintéshez

source: Overview
hu_hu: Áttekintés

source: Security
hu_hu: Biztonság

source: Users
hu_hu: Felhasználók

source: Insufficient permissions.
hu_hu: Nincs elegendő jogosultság.

source: Please enter both Client ID and Client Secret.
hu_hu: Kérjük, add meg a Client ID-t és a Client Secretet is.

source: The Client ID does not appear to be in the correct format.
hu_hu: A Client ID formátuma valószínűleg nem megfelelő.

source: The Client Secret appears to be too short.
hu_hu: A Client Secret valószínűleg túl rövid.

source: Credentials format validation passed. Save your settings to apply them.
hu_hu: A hitelesítő adatok formátuma érvényes. Mentsd a beállításokat az alkalmazáshoz.

source: Your Google account is not authorized to access this site. Please contact an administrator to request access.
hu_hu: A Google-fiókod nincs jogosítva az oldal elérésére. Kérjük, vedd fel a kapcsolatot egy rendszergazdával jogosultság kéréséhez.

source: Authentication failed: Could not connect to Google servers. Please try again in a moment.
hu_hu: Hitelesítés sikertelen: Nem sikerült csatlakozni a Google szervereihez. Kérlek, próbáld meg később újra.

source: Authentication failed: No access token received from Google. Please try again.
hu_hu: Hitelesítés sikertelen: Nem érkezett hozzáférési token a Google-tól. Kérlek, próbáld újra.

source: Authentication successful, but account creation failed. Please contact an administrator for assistance.
hu_hu: Hitelesítés sikeres, de a fiók létrehozása sikertelen volt. Kérjük, fordulj egy rendszergazdához segítségért.

source: Invalid authentication data received from Google. Please try signing in again.
hu_hu: Érvénytelen hitelesítési adatok érkeztek a Google-tól. Kérlek, próbálj meg ismét bejelentkezni.

source: Could not retrieve your user information from Google. Please check your Google account permissions and try again.
hu_hu: Nem sikerült lekérni a felhasználói adataidat a Google-tól. Kérjük, ellenőrizd a Google-fiók jogosultságait, és próbáld újra.

source: No email address was provided by Google. Please ensure your Google account has a verified email address.
hu_hu: A Google nem szolgáltatott e-mail címet. Kérjük, győződj meg róla, hogy a Google-fiókodnak van igazolt e-mail címe.

source: Authentication session expired or invalid. Please try logging in again.
hu_hu: A hitelesítési munkamenet lejárt vagy érvénytelen. Kérjük, próbálj meg újra bejelentkezni.

source: An unknown authentication error occurred. Please try again.
hu_hu: Ismeretlen hitelesítési hiba történt. Kérjük, próbáld újra.

source: Authenticating with Google...
hu_hu: Hitelesítés Google-lal...

source: Welcome Back
hu_hu: Örülünk, hogy visszatértél

source: Sign in with your Google account to continue.
hu_hu: Jelentkezz be Google-fiókoddal a folytatáshoz.

source: Continue with Google
hu_hu: Folytatás Google-lel

source: Login experience by
hu_hu: Bejelentkezési élmény:

source: Signing you in...
hu_hu: Bejelentkeztetünk...

source: Login Disabled:
hu_hu: Bejelentkezés letiltva:

source: Password-based login is disabled. Please use Google Sign-In.
hu_hu: A jelszóalapú bejelentkezés ki van kapcsolva. Kérjük, használd a Google bejelentkezést.

source: Google Account Information
hu_hu: Google-fiók adatai

source: Google Profile Picture
hu_hu: Google profilkép

source: This profile picture is synced from your Google account.
hu_hu: Ez a profilkép a Google-fiókodból szinkronizálva van.

source: Authentication Method
hu_hu: Hitelesítési mód

source: Google Sign-In
hu_hu: Google bejelentkezés

source: This user authenticates via Google OAuth.
hu_hu: Ez a felhasználó Google OAuth-on keresztül hitelesít.

source: Access Denied
hu_hu: Hozzáférés megtagadva

source: You are not currently logged in.
hu_hu: Jelenleg nem vagy bejelentkezve.

source: One Tap Login:
hu_hu: Egyérintéses bejelentkezés:

source: Please %1$sconfigure your Google OAuth credentials%2$s to enable secure sign-in.
hu_hu: Kérjük, %1$sállítsd be a Google OAuth hitelesítő adataidat%2$s a biztonságos bejelentkezés engedélyezéséhez.

source: Warning:
hu_hu: Figyelem:

source: One Tap Login is not fully configured. Users may not be able to log in until you complete the setup.
hu_hu: Az Egyérintéses bejelentkezés nincs teljesen beállítva. Előfordulhat, hogy a felhasználók nem tudnak bejelentkezni, amíg be nem fejezed a beállítást.

source: New user sign-ups are enabled with elevated permissions. Monitor your site for unauthorized content.
hu_hu: Új felhasználói regisztrációk engedélyezve emelt jogosultságokkal. Figyeld az oldaladat illetéktelen tartalom szempontjából.

source: New user sign-ups are enabled. Monitor your user registrations for potential spam accounts.
hu_hu: Új felhasználói regisztrációk engedélyezve. Figyeld a regisztrációkat esetleges spam fiókok után.

source: Security Notice:
hu_hu: Biztonsági értesítés:

source: Settings
hu_hu: Beállítások

source: Rate Plugin ★★★★★
hu_hu: Értékeld a bővítményt ★★★★★

source: One Tap Login Error:
hu_hu: Egyérintéses bejelentkezés hiba:

source: A fatal error was detected and logged. Please check your PHP error log for details.
hu_hu: Végzetes hibát észleltünk és naplóztunk. Kérjük, ellenőrizd a PHP hibalogot a részletekért.
